# Спецификация модуля

## Модуль для сортировки матрицы по убыванию

### Описание:

Этот модуль предоставляет функцию для сортировки элементов вещественной матрицы размерности m * n по убыванию. Алгоритм обходит матрицу по строкам, сравнивая элементы и переставляя их местами, чтобы получить отсортированную матрицу.

### Входные данные:

matrix: Вещественная матрица размерности m * n.

### Выходные данные:

temp: временная отсортированная матрица, элементы которой расположены по убыванию и заменяют первоначальную матрицу.

### Алгоритм:

1. Обход матрицы по строкам:
Функция проходит по каждой строке матрицы matrix.

2. Сравнение и перестановка элементов:
Для каждого элемента в строке функция сравнивает его с элементами, находящимися справа от него.
Если текущий элемент меньше элемента справа, они меняются местами.

3. Повторение:
Шаги 2 и 3 повторяются до тех пор, пока не будут отсортированы все строки матрицы.

Пример:
```
        int m = 3; //количество строк
        int n = 4; //количество столбцов

        //Создаём матрицу и задаём элементы
        double[,] matrix = {
            {5.9, 2.3, 8.1, 3.7},
            {1.2, 4.5, 6.2, 0.9},
            {3.4, 7.8, 2.1, 5.6}
        };

//Создаём функцию для сортировки матрицы
static void SortMatrixDescending(double[,] matrix, int m, int n)
{
    double[] temp = new double[m * n];
    int index = 0;

    for (int i = 0; i < m; i++)
    {
        for (int j = 0; j < n; j++)
        {
            temp[index] = matrix[i, j];
            index++;
        }
    }

    Array.Sort(temp);
    Array.Reverse(temp);

    index = 0;

    for (int i = 0; i < m; i++)
    {
        for (int j = 0; j < n; j++)
        {
            matrix[i, j] = temp[index];
            index++;
        }
    }
}
//Вывод матрицы
Console.WriteLine("Отсортированная матрица:");
for (int i = 0; i < m; i++)
{
    for (int j = 0; j < n; j++)
    {
        Console.Write(matrix[i, j] + " ");
    }
    Console.WriteLine();
}
```

### Функция

SortMatrixDescending(double[,] matrix, int m, int n) - принимает элементы матрицы и ее строк и столбцов. Для сортировки матрицы создаёт временную матрицу temp.

Пример:
```
static void SortMatrixDescending(double[,] matrix, int m, int n)
    {
        double[] temp = new double[m * n];
        int index = 0;
        
        for (int i = 0; i < m; i++)
        {
            for (int j = 0; j < n; j++)
            {
                temp[index] = matrix[i, j];
                index++;
            }
        }
        
        Array.Sort(temp);
        Array.Reverse(temp);
        
        index = 0;
        
        for (int i = 0; i < m; i++)
        {
            for (int j = 0; j < n; j++)
            {
                matrix[i, j] = temp[index];
                index++;
            }
        }
    }
```
### Преимущества:

1. Простая реализация.
2. Обеспечивает корректную сортировку элементов матрицы по убыванию.

### Недостатки:

1. Для больших матриц может быть неэффективным по времени выполнения.
2. Не учитывает порядок следования элементов внутри строки, если их значения равны.

### Функции:

sort_matrix(matrix): Функция для сортировки матрицы. Принимает на вход матрицу и возвращает отсортированную матрицу.
